[
  {
    "id": 0,
    "type": "image",
    "title": "The Council of Student Organizations kicks off its Annual Recruitment Week",
    "description": "The weeklong event gives Lasallians an opportunity to choose among 47 organizations under the CSO-an avenue for students to hone their skills and passions beyond their academic life.\nThe CSO ARW runs from today until Saturday, September 20."
  },
  {
    "id": 1,
    "type": "video",
    "title": "The Philippine economy has lost over PHP 100-B",
    "description": "In this ARCHers Recap: The Philippine economy has lost over PHP 100-B due to alleged “ghost” flood control projects under the Department of Public Works and Highways."
  },
  {
    "id": 2,
    "type": "image",
    "title": "Hype for UAAP Season 88 continues to grow stronger",
    "description": "Hype for UAAP Season 88 continues to grow stronger as athletes, coaches, and media all gathered at the Collegiate Basketball Press Conference today, September 15, at Gloria Maris Shark’s Fin Restaurant in Greenhills, San Juan!\nThe press conference introduced the upcoming UAAP Season 88 Correspondents, including Sophie Espiritu, who will make her debut as De La Salle University’s Correspondent. Announced alongside this, viewers may also look forward to expanded coverage of several UAAP sports on the Pilipinas Live streaming platform.\nPre-season activities continue to brew in anticipation of the season’s Opening Ceremony, which will be held on September 19, at the University of Santo Tomas."
  },
  {
    "id": 3,
    "type": "image",
    "title": "The DLSU Office of the President conducted its annual University General Assembly (UGA) today",
    "description": "The DLSU Office of the President conducted its annual University General Assembly (UGA) today, September 12, at the Chapel of the Most Blessed Sacrament, which covered the milestones and goals of the university. \nNotable university achievements presented in the assembly include the approval of the Lasallian Health Education, Accessible Resources Training, and the Detect TB (Tuberculosis) projects of the DLSU SDG City by the Manila City LGU."
  },
  {
    "id": 4,
    "type": "video",
    "title": "At Archers Network, we welcome future scarers with open doors",
    "description": "Knock knock, ARCH! Got room for one more? 🚪\nAt Archers Network, we welcome future scarers with open doors—sparking imaginations and offering limitless opportunities. The bravest entrances bring in the brightest minds, each leaving their\nmark on the scare floor. 😈❕\nWhat are you waiting for? A little push through the door might unlock your full potential! 🤩\nPRIMER: https://tinyurl.com/ARCH-T1-ARW-PRIMER\nAPPLICATION FORMS: https://tinyurl.com/ARCH-T1-ARW-FORMS"
  },
  {
    "id": 5,
    "type": "image",
    "title": "Transitioning to a greener future",
    "description": "HAPPENING NOW: The DLSU University Sustainability Office, in collaboration with the German Embassy Manila and the German Development Cooperation Agency, commences its opening ceremony for the “Energy in Transition - Powering Tomorrow”, an interactive audio-visual exhibit at the Learning Commons, 6th Floor of the Henry Sy Sr. Hall today, September 9.\nThe exhibit encourages gearing toward energy transition to combat the use of non-renewable sources such as fossil fuels and advocating for an eco-friendly environment that utilizes energy conservation. \nThe event will run until September 11 at the same venue."
  },
  {
    "id": 6,
    "type": "video",
    "title": "FAST2024 Batch Legislator Ken Cayanan shares lessons from the EDSA People Power Revolution",
    "description": "FAST2024 Batch Legislator Ken Cayanan shares lessons from the EDSA People Power Revolution that we can apply to the upcoming elections. He emphasizes that the power lies with the public, not those currently in office—urging voters to avoid disinformation and reclaim their rightful power."
  },
  {
    "id": 7,
    "type": "video",
    "title": "DLSU President Br. Bernard Oca FSC highlights the importance of remembering the EDSA People Power Revolution",
    "description": "DLSU President Br. Bernard Oca FSC highlights the importance of remembering the EDSA People Power Revolution and its significance in Philippine history. He also recalls the miracle that unfolded during the revolution, which brought together Filipinos to fight against and overthrow the late dictator Ferdinand Marcos Sr."
  },
  {
    "id": 8,
    "type": "image",
    "title": "Over 8 million Filipinos unite in faith on feast of Jesus Nazareno",
    "description": "More than 8 million devotees gathered for the 2025 Traslacion, marking a historic milestone as the Feast of Jesus Nazareno was celebrated as a \"National Feast\" for the first time yesterday, January 9. \nThe nearly 21-hour procession began at 4:41 AM on January 9 at Quirino Grandstand and ended at 1:26 AM on January 10 at the Minor Basilica and National Shrine of Jesus Nazareno in Quiapo.\nDespite challenges like snapped ropes, stalled movements, and over 500 reported injuries, devotees fulfilled their \"panata,\" braving the massive crowds to touch the image and ropes in witness of their faith. "
  },
  {
    "id": 9,
    "type": "image",
    "title": "A total lunar eclipse reaches its peak at 2:12 AM today",
    "description": "A total lunar eclipse reaches its peak at 2:12 AM today, September 8, casting a Blood Moon over Manila and other parts of the Philippines.\nThe eclipse entered its penumbral phase, the initial and final stages of its formation, at 11:27 PM yesterday, and will last until 3:57 AM today."
  }
]